[
  {
    "id": 14,
    "created_at": "2022-06-19T22:26:48.470944+00:00",
    "title": "Thai Mango Salad with Peanut Dressing",
    "url": "https://cookieandkate.com/thai-mango-salad-with-peanut-dressing/#tasty-recipes-24132-jump-target",
    "image_url": "https://cookieandkate.com/images/2016/06/thai-green-salad.jpg",
    "instructions": [
      "To assemble the salad, simply combine all of the salad ingredients in a large serving bowl.",
      "To prepare the dressing, combine all of the ingredients in a liquid measuring cup or bowl, and whisk until combined.",
      "When you’re ready to serve, drizzle the dressing over the salad, and toss to combine. Serve immediately."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "Thai mango salad",
        "ingredients": [
          "One head (about 7 ounces) butter leaf lettuce or your greens of choice, chopped into bite-sized pieces",
          "1 red bell pepper, thinly sliced and then sliced across to make 1″ long pieces",
          "3 ripe champagne mangos, diced",
          "½ cup thinly sliced green onion (both green and white parts)",
          "⅓ cup chopped roasted peanuts",
          "¼ cup chopped fresh cilantro",
          "1 medium jalapeño, seeds and membranes removed, finely chopped"
        ]
      },
      {
        "title": "Peanut dressing",
        "ingredients": [
          "¼ cup creamy peanut butter",
          "¼ cup lime juice (about 2 to 3 limes)",
          "1 tablespoon tamari or soy sauce",
          "1 tablespoon apple cider vinegar",
          "1 tablespoon honey or maple syrup",
          "1 teaspoon sesame oil",
          "2 cloves garlic, pressed or minced",
          "Pinch of red pepper flakes (if you like spice)"
        ]
      }
    ]
  },
  {
    "id": 15,
    "created_at": "2022-06-19T22:53:46.026321+00:00",
    "title": "Chocolate Caramel Twix Cheesecake",
    "url": "https://www.thatskinnychickcanbake.com/twix-cheesecake",
    "image_url": "https://i2.wp.com/www.thatskinnychickcanbake.com/wp-content/uploads/2016/11/Twix-Cheesecake-11-1.jpg",
    "instructions": [
      "To make the crust, combine all ingredients and press into a 9-inch springform pan. Bake at 350º for 8 minutes. Let cool. Keep oven on to bake cheesecake.",
      "To make cheesecake, using a stand mixer fitted with a paddle attachment, beat 1 package of the cream cheese, ⅓ cup of the sugar, and the cornstarch together on low until creamy, about 3 minutes, scraping down the sides of the bowl as needed.",
      "Blend in the remaining cream cheese, one package at a time, beating well and scraping down the bowl after each.",
      "Increase the mixer speed to medium and beat in the remaining sugar, then the vanilla. Mix in the eggs, one at a time, beating well after each. Beat in the cream just until completely blended.",
      "The filling will look light, creamy, airy, and almost like billowy clouds. Be careful not to over mix.",
      "Gently scrape out the batter onto the crust. Wrap the sides of the pan in aluminum foil.",
      "Place the cake pan in a large shallow pan containing hot water that comes halfway (about 1 inch) up the side of the springform pan. Bake until the top is a very light golden brown and the center barely jiggles for about 1¼ hours. Remove the cheesecake from the water bath, transfer to a wire rack, and let cool for 2 hours. Chill until cold.",
      "To make the caramel, combine all in a heatproof bowl and microwave in 1-minute intervals until completely smooth and blended. Stir after each minute. Let cool a bit. You will only need about half of the caramel for this cheesecake.",
      "To make the ganache, heat the cream just to a boil and pour over the chopped chocolate in a heatproof bowl. Let sit for 2 minutes. Stir until chocolate is melted.",
      "To assemble the cheesecake, pour about half the caramel into the center where the center has deflated down a bit. Chill just to firm up the caramel. (Note I did not add a caramel layer, but instead drizzled each slice with caramel as I served).",
      "Pour on the chocolate ganache and chill for several hours or overnight before unmolding from the pan. Top with fun-sized Twix bars if desired.",
      "To serve, carefully remove the springform pan sides. Cut into slices and serve with caramel sauce."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "Crust",
        "ingredients": [
          "1 1 /2 cups graham cracker crumbs",
          "1 tablespoon sugar",
          "6 tablespoons melted butter"
        ]
      },
      {
        "title": "Cheesecake",
        "ingredients": [
          "32 ounces cream cheese, at room temperature",
          "1 2/3 cups sugar",
          "1/4 cup cornstarch",
          "1 tablespoon pure vanilla",
          "2 eggs",
          "3/4 cup heavy whipping cream"
        ]
      },
      {
        "title": "Caramel Sauce",
        "ingredients": [
          "40 Kraft caramels, unwrapped",
          "1 can sweetened condensed milk",
          "5 Tablespoons butter"
        ]
      },
      {
        "title": "Ganache",
        "ingredients": [
          "2 cups heavy cream",
          "12 ounces semisweet chocolate, chopped (I used three 4-ounce Ghirardelli semisweet chocolate bars)"
        ]
      },
      {
        "title": "Garnish",
        "ingredients": [
          "Fun-sized Twix bars, optional"
        ]
      }
    ]
  },
  {
    "id": 17,
    "created_at": "2022-06-19T22:58:29.658923+00:00",
    "title": "Crispy Chicken Tinga Tacos",
    "url": "https://www.halfbakedharvest.com/crispy-chicken-tinga-tacos/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2022/03/Crockpot-Crispy-Chicken-Tinga-Tacos-with-Avocado-Jalapeño-Crema-1.jpg",
    "instructions": [
      "In the bowl of your crockpot, combine the chicken, onion, enchilada sauce, chipotle, oregano, cumin, and salt. Cover and cook on LOW for 4-5 hours or on HIGH for 2-3 hours.",
      "When finished cooking, shred the meat and toss with the sauce. Preheat the oven to 425° F.",
      "Warm the tortillas for 30 seconds to 1 minute in the microwave, until pliable. On a baking sheet, rub the tortillas with olive oil. Lay each tortilla flat and then layer evenly with cheese and chicken. Fold the other half of the tortilla over the filling, gently pushing to adhere (see above photo). Transfer to the oven and bake for 5-8 minutes, then flip and cook another 5 minutes, or until the cheese has melted and the tortillas are crisp.",
      "Meanwhile, make the Avocado Crema. Combine all ingredients in a blender and blend until smooth and creamy. Season with salt.",
      "Serve the tacos topped with avocado, lettuce, limes, and any other desired toppings."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 1/2 pounds boneless chicken breasts or thighs",
          "1 yellow onion, chopped",
          "3/4 cup red enchilada sauce",
          "2-3 chipotle peppers in adobo, finely chopped",
          "1 teaspoon dried oregano",
          "1 teaspoon ground cumin",
          "1 teaspoon kosher salt",
          "12-16 corn tortillas, warmed",
          "1/2 cup shredded pepper jack cheese",
          "1/2 cup shredded cheddar cheese",
          "shredded lettuce and pickled onions, for serving"
        ]
      },
      {
        "title": "Crema",
        "ingredients": [
          "2 large avocados, halved",
          "1/4-1/2 cup pickled jalapeños",
          "1/2 cup fresh cilantro",
          "1-2 teaspoons honey",
          "1 clove garlic, grated",
          "2 limes (juice from)",
          "flaky salt"
        ]
      }
    ]
  },
  {
    "id": 18,
    "created_at": "2022-06-19T22:58:57.62926+00:00",
    "title": "Rigatoni with Vodka Sauce",
    "url": "https://www.bonappetit.com/recipe/rigatoni-with-easy-vodka-sauce",
    "image_url": "https://assets.bonappetit.com/photos/5a8da4996497380283798c16/16:9/w_1280,c_limit/rigatoni-with-vodka-sauce.jpg",
    "instructions": [
      "Fill a stock pot or other large pot three-quarters full with water and heat over high. Toss in a handful of salt and bring to a boil while you do your other prep.",
      "Peel and finely chop 1 onion.",
      "Firmly smash 4 garlic cloves with the flat side of a chef’s knife and remove peel.",
      "Grate 4 oz. Parmesan on the smallest holes of the box grater.",
      "Heat 2 Tbsp. oil in a Dutch oven over medium (position it next to pot of water). Add onion and garlic and cook, stirring constantly, just until onion is starting to brown around the edges, 5–7 minutes.",
      "Add entire 4.5-oz. tube tomato paste and ½ tsp. red pepper flakes and stir until paste evenly coats onion. Continue to cook, stirring often, until paste is deep red and starting to brown on bottom of pot, 5–7 minutes.",
      "Add 2 oz. vodka to deglaze pan and stir to incorporate, scraping bottom of pot. Reduce heat to low.",
      "Using a heatproof glass measuring cup, scoop about ¼ cup boiling water from pot, then add ¾ cup heavy cream to measuring cup (this brings up the temperature of the cream so it won’t break when you add it to the pot).",
      "Slowly add warmed cream to Dutch oven, stirring constantly, until a smooth sauce forms. Remove from heat.",
      "Add 1 lb. rigatoni to pot of boiling salted water and cook according to package instructions until al dente. About 1 minute before the timer goes off, use heatproof measuring cup to scoop up about 1 cup pasta cooking liquid. Heat Dutch oven over low.",
      "Using a spider, transfer rigatoni to Dutch oven along with any water that’s piggybacking on the pasta.",
      "Add ½ cup pasta cooking liquid to Dutch oven and stir to incorporate, then gradually add half of Parmesan, stirring constantly to melt cheese. You should have a smooth, glossy sauce that coats each piece of pasta. Season with salt and add a splash more pasta cooking liquid to thin sauce, if needed.",
      "Divide pasta among bowls. Top with remaining cheese, dividing evenly. Drizzle with more oil, then tear basil leaves over."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "Kosher salt",
          "1 medium onion",
          "4 garlic cloves",
          "4 oz. Parmesan cheese",
          "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
          "1 4.5-oz. tube double-concentrated tomato paste",
          "½ tsp. crushed red pepper flakes",
          "2 oz. vodka",
          "¾ cup heavy cream",
          "1 lb. rigatoni",
          "Basil leaves (for serving)"
        ]
      }
    ]
  },
  {
    "id": 20,
    "created_at": "2022-06-19T23:05:56.416018+00:00",
    "title": "Spaghetti Carbonara Recipe",
    "url": "https://cooking.nytimes.com/recipes/12965-spaghetti-carbonara",
    "image_url": "https://static01.nyt.com/images/2021/02/14/dining/carbonara-horizontal/carbonara-horizontal-articleLarge-v2.jpg",
    "instructions": [
      "Place a large pot of lightly salted water (no more than 1 tablespoon salt) over high heat, and bring to a boil.",
      "In a mixing bowl, whisk together the eggs, yolks and pecorino and Parmesan. Season with a pinch of salt and generous black pepper.",
      "Set the water to boil. Meanwhile, heat oil in a large skillet over medium heat, add the pork, and sauté until the fat just renders, on the edge of crispness but not hard. Remove from heat and set aside.",
      "Add pasta to the water and boil until a bit firmer than al dente. Just before pasta is ready, reheat guanciale in skillet, if needed. Add  pasta to the skillet over low heat (or no heat). Stir for a minute or so, to deglaze the pan.",
      "Stir in cheese mixture to pasta & meat mixture. Add some reserved pasta water if needed for creaminess. Serve immediately, dressing it with a bit of additional grated pecorino and pepper."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "Salt",
          "2 large eggs and 2 large yolks, room temperature",
          "1 ounce (about 1/3 packed cup) grated pecorino Romano, plus additional for serving",
          "1 ounce (about 1/3 packed cup) grated Parmesan",
          "Coarsely ground black pepper",
          "3 ½ ounces of slab guanciale (see recipe), pancetta or bacon, sliced into pieces about 1/4 inch thick by 1/3 inch square",
          "12 ounces spaghetti (about 3/4 box)"
        ]
      }
    ]
  },
  {
    "id": 2,
    "created_at": "2022-06-25T20:45:49.821362+00:00",
    "title": "Easiest Chicken Adobo Recipe",
    "url": "https://www.bonappetit.com/recipe/easiest-chicken-adobo",
    "image_url": "https://assets.bonappetit.com/photos/59dfb869d4ce5d0f9308549b/16:9/w_1280,c_limit/chicken-adobo.jpg",
    "instructions": [
      "Without separating or peeling the cloves, cut entire head of garlic in half through the “equator” (it’s fine if some cloves become detached). Thinly slice 1 green chile, removing seeds if desired for less heat.",
      "If you got whole chicken legs (if not, go to the next step), cover surface of cutting board with a double layer of plastic wrap and place legs skin side up on top (this is to protect your board from any possible contamination; if you have a cutting board that you use for raw meat, use that). You’re going to split the legs into thighs and drumsticks. Working one leg at at time, wiggle drumstick so you can see the joint connecting the thigh and drumstick. Slice down with your knife crosswise between the two, aiming for the joint, until you hit bone. Grasp leg with thigh in one hand and drumstick in the other and break the joint, then cut the rest of the way through with your knife. Repeat with remaining legs.",
      "Heat 1 Tbsp. vegetable oil in a large Dutch oven over medium. Add chicken skin side down and cook, lifting pieces with tongs once or twice toward the end to let hot fat flow underneath, until fat is rendered and skin is crisp and golden brown, 7–10 minutes. Transfer skin side up to a plate. Because drumsticks are covered entirely in skin, you can brown both sides, but it’s not necessary.",
      "Add ¾ cup vinegar, ¾ cup soy sauce, 1 Tbsp. brown sugar, 5 bay leaves, and reserved garlic and sliced chile to Dutch oven. Bring to a simmer, then reduce heat to low, stirring to dissolve sugar. Season generously with pepper.",
      "Return chicken to pot skin side up. Cover and cook chicken very gently, adjusting heat to maintain a bare simmer and turning pieces once, until meat is very tender and pulling away from bone (but not so tender that it’s falling apart), 35–40 minutes.",
      "While chicken is simmering, cook 1 cup rice in medium pot according to package directions.",
      "Transfer chicken to a clean plate. Increase heat to medium-high and boil braising liquid, shaking pot often, until liquid has formed a rich sauce thick enough to coat the back of a spoon, about 5 minutes. Remove pot from heat and return chicken to pot, turning to coat in sauce.",
      "Serve chicken and sauce over rice. Thinly slice remaining chile and scatter over, then season with more pepper."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 head of garlic",
          "2 green chiles (such as serrano or jalapeño), divided",
          "4 bone-in, skin-on chicken thighs and 4 drumsticks, or 4 whole chicken legs",
          "1 tablespoon vegetable oil",
          "¾ cup distilled white vinegar",
          "¾ cup soy sauce (not low sodium)",
          "5 dried bay leaves",
          "1 tablespoon light or dark brown sugar",
          "Freshly ground black pepper",
          "1 cup uncooked white rice, preferably short grain"
        ]
      }
    ]
  },
  {
    "id": 21,
    "created_at": "2022-06-20T23:06:42.588322+00:00",
    "title": "Tagliatelle with Smashed Peas",
    "url": "https://www.foodnetwork.com/recipes/giada-de-laurentiis/tagliatelle-with-smashed-peas-sausage-and-ricotta-cheese-recipe-1955733",
    "image_url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/1/25/0/EI1104_Tagliatelle_with_smashed_peas.jpg.rend.hgtvcom.616.462.suffix/1398793573631.jpeg",
    "instructions": [
      "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes if dry or according to package directions if fresh. Drain pasta reserving 1 cup of the pasta cooking water.",
      "Meanwhile, in a large, heavy skillet heat the olive oil and garlic over medium-high heat and add the sausage. Use a wooden spoon to break up the sausage into bite-sized bits. When the sausage has browned, about 5 minutes. Remove and set aside. Add the peas to the pan and, using the back of the wooden spoon, smash the peas. Turn off the heat. Add the ricotta cheese along with the cooked pasta and toss to coat, adding the pasta cooking water in 1/4 cup additions, if needed, to make the pasta moist. Return the sausage to the pan. Add the basil, Pecorino Romano cheese, and salt. Toss gently to coat and serve immediately."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 pound fresh or dried tagliatelle pasta (or other wide, long pasta)",
          "2 tablespoons olive oil",
          "2 cloves garlic, chopped",
          "1 pound hot Italian sausage, casings removed",
          "1 pound frozen peas, thawed",
          "1 cup whole milk ricotta cheese",
          "1 bunch fresh basil leaves chopped (about 3/4 cup)",
          "1/4 cup fresh grated Pecorino Romano cheese",
          "1 teaspoon salt"
        ]
      }
    ]
  },
  {
    "id": 22,
    "created_at": "2022-06-20T23:13:31.212922+00:00",
    "title": "Pizza Dough",
    "url": "https://prohomecooks.com/recipes/15-common-mistakes-when-making-pizza-at-home/",
    "image_url": "",
    "instructions": [
      "Add 1½ teaspoons of rapid rise instant yeast instead of the whole package so you can slow down the fermentation period and develop more flavor in your dough. It’ll take longer but it will be worth it. Along with the yeast, add in 2 cups of water and 1 teaspoon of honey to get the yeast activated. Give it 15 – 30 minutes to bloom and smell yeasty.",
      "Add 2 tablespoons olive oil, 2 teaspoons salt, 2 cups of all purpose flour and 2 cups of 00 flour to start. Give it a mix and you will notice that it is a little wet. So, add another 1 cup of flour. You will still be left with a wet sticky dough but let it rest for about 10 – 15 minutes before giving it a good knead for 4 – 5 minutes.",
      "After the kneading, give it time to rest so that the gluten can rest and absorb some water. We want the dough to be nice and smooth and supple without adding more flour so its important to let the dough relax on your counter for 10 minutes. The last thing you want to do is add a ton of flour just because it’s sticking. Instead, let it rest and then give it 4 -5 more minutes of kneading.",
      "Once you are finished kneading the second time, let the dough double in size. It should take 1 – 3 hours depending on your environment."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1½ teaspoons of yeast",
          "2 cups of water",
          "1 teaspoon of honey",
          "2 cups of all purpose flour",
          "3 cups of 00 flour",
          "2 teaspoons of salt",
          "2 tablespoons of olive oil",
          "Semolina, used to roll out your pizza dough"
        ]
      }
    ]
  },
  {
    "id": 24,
    "created_at": "2022-06-20T23:39:46.305636+00:00",
    "title": "Creamy Tuscan Chicken",
    "url": "https://www.delish.com/cooking/recipe-ideas/a19636089/creamy-tuscan-chicken-recipe/",
    "image_url": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/20191011-creamy-tuscan-chicken-delish-ehg-2521-1571259466.jpg?crop=1.00xw:0.752xh;0,0.113xh&resize=1200:*",
    "instructions": [
      "In a skillet over medium heat, heat oil. Add chicken and season with salt, pepper, and oregano. Cook until golden and no longer pink, 8 minutes per side. Remove from skillet and set aside.",
      "In the same skillet over medium heat, melt butter. Stir in garlic and cook until fragrant, about 1 minute. Add cherry tomatoes and season with salt and pepper. Cook until tomatoes are beginning to burst then add spinach and cook until spinach is beginning to wilt.",
      "Stir in heavy cream and parmesan and bring mixture to a simmer. Reduce heat to low and simmer until sauce is slightly reduced, about 3 minutes. Return chicken to skillet and cook until heated through, 5 to 7 minutes.",
      "Serve with lemon wedges."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 tbsp. extra-virgin olive oil",
          "4 boneless skinless chicken breasts",
          "Kosher salt",
          "Freshly ground black pepper",
          "1 tsp. dried oregano",
          "3 tbsp. butter",
          "3 cloves garlic, minced",
          "1 1/2 c. cherry tomatoes, halved",
          "3 c. baby spinach",
          "1/2 c. heavy cream",
          "1/4 c. freshly grated Parmesan",
          "Lemon wedges, for serving"
        ]
      }
    ]
  },
  {
    "id": 25,
    "created_at": "2022-06-20T23:43:08.925143+00:00",
    "title": "Curried Chicken Salad",
    "url": "https://themodernproper.com/curried-chicken-salad-salad",
    "image_url": "",
    "instructions": [
      "In a large bowl combine all ingredients except mixed greens, cucumber and tomatoes. Mix until fully combined. If you find it to be too dry, add more yogurt 1 tablespoon at a time.",
      "In a small bowl whisk together ingredients for dressing.",
      "To assemble, scoop one cup of the chicken salad onto a bed of lettuce. Add tomatoes and cucumbers and then add dressing."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "3 cups chicken breast, shredded",
          "3 celery stalks, finely chopped",
          "1 bunch scallions, thinly sliced",
          "1/2 cup golden raisins",
          "1 cup plain greek yogurt",
          "1 lemon, juiced",
          "1 tbsp honey",
          "1/4 tsp cayenne pepper (optional)",
          "1 tbsp curry powder",
          "1 tsp salt",
          "2 tsp freshly ground pepper",
          "mixed greens",
          "english cucumber, thinly sliced",
          "cherry tomatoes, halved"
        ]
      },
      {
        "title": "Salad Dressing",
        "ingredients": [
          "1/2 cup olive oil",
          "6 tbsp rice wine vinegar",
          "1 tbsp honey",
          "1/2 tsp salt",
          "freshly ground pepper"
        ]
      }
    ]
  },
  {
    "id": 26,
    "created_at": "2022-06-20T23:51:40.396216+00:00",
    "title": "Fermented Hot Sauce With Fresno Chilis, Garlic, and, and Tamari Recipe",
    "url": "https://www.seriouseats.com/charred-fresno-tamari-and-roasted-garlic-fermented-hot-sauce",
    "image_url": "https://www.seriouseats.com/thmb/6rFgS88cjB344RnVDp8vJxyxjRs=/1500x1125/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210128-fermented-hot-sauce-charred-fresno-tamari-vicky-wasik-ec8e5f05468443f9adc456686fbff1c9.jpg",
    "instructions": [
      "For The Mash Adjust oven rack as close as possible to broiler element and preheat broiler to high. On a foil-lined rimmed baking sheet, arrange 10 1/2 ounces (300g) peppers in a single layer. Broil until peppers are blistered and well charred, 5 to 8 minutes per side. Cooked peppers should weigh about 7 ounces (200g) after broiling. Let peppers cool completely before using.",
      "In a food processor, pulse charred peppers, remaining 14 1/2 ounces (400g) fresh peppers, water, tamari, and salt until coarse mash forms, 16 to 20 pulses.",
      "Transfer pepper mash to a clean wide-mouth, 1-quart canning jar. Tap jar lightly on palm to remove any air pockets. Cover surface of mash with plastic wrap, pressing gently to ensure full contact, and weigh down with fermentation weight or small jar lid. Seal jar with airlock lid following manufacturer's instructions.",
      "Store pepper mash in dark area away from sun and let ferment, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C), for 7 days; check mixture daily for signs of gas formation (mash will climb up sides of jar; this is a good sign). Starting on the 7th day, taste mash daily until it has reached a pleasantly sour flavor (like sauerkraut); the total fermentation time can take anywhere from 7 to 21 days.",
      "To Finish the Hot Sauce Scrape mash into a blender. Add vinegar, sugar, and salt, and blend on high speed until smooth, about 1 minute. With blender running, slowly stream in garlic oil and blend until smooth and emulsified, about 1 minute longer. Measure pH using strips or pH-meter to make sure sauce is about 3.4; if it is too high, lower pH to 3.4 with more vinegar as needed.",
      "Strain sauce through fine-mesh strainer set over a nonreactive bowl or large container, pressing on solids to extract as much liquid as possible; reserve solids for another use (see note).",
      "Transfer strained hot sauce to glass bottles or jar, cover, and keep refrigerated until ready to use. Sauce will keep refrigerated for up to 1 month."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "For The Mash",
        "ingredients": [
          "25 ounces (700g) stemmed Fresno chile peppers (from about 1 3/4 pounds/800g whole peppers)",
          "1/4 cup (60ml) bottled, filtered, or distilled water",
          "3 tablespoons (45ml) tamari",
          "1 tablespoon (10g) Diamond Crystal kosher salt; for table salt use half as much by volume or the same weight"
        ]
      },
      {
        "title": "To Finish the Hot Sauce",
        "ingredients": [
          "1/2 cup (120ml) distilled white vinegar",
          "2 teaspoons (10g) sugar",
          "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt use half as much by volume or the same weight",
          "1/2 cup (120ml) roasted garlic oil"
        ]
      }
    ]
  },
  {
    "id": 27,
    "created_at": "2022-06-20T23:53:24.420809+00:00",
    "title": "Ricotta Gnocchi Recipe",
    "url": "https://www.seriouseats.com/ricotta-gnocchi-homemade-food-lab-recipe",
    "image_url": "https://www.seriouseats.com/thmb/jvX0yyOyvwupT2cxkE_pOVSeEbo=/1500x1125/filters:fill(auto,1)/ricotta-gnocchi-homemade-food-lab-recipe-hero-01-94285c390c56416ab6f550428b4656ce.JPG",
    "instructions": [
      "Line a large plate with three layers of paper towels or a clean dish towel. Transfer ricotta directly to paper towels and spread with a rubber spatula. Place another triple layer of paper towels or a clean dish towel on top and press down firmly with the palms of your hands to blot excess moisture. Peel off upper paper towels.",
      "Place a large bowl on a scale and zero the scale. Scrape ricotta into bowl to weigh. Remove excess ricotta to leave exactly 8 ounces. Reserve excess ricotta for another use. Add Parmesan, 3 1/2 ounces of flour, whole egg, and egg yolk to bowl. Season with salt and pepper. Combine mixture with a rubber spatula. It should be sticky but not loose. Add flour a tablespoon at a time if it is still very moist after kneading with the spatula for 1 minute.",
      "Transfer dough to a lightly floured work surface and dust the top with flour. Flatten into a 4- to 6-inch disk and cut into quarters using a bench scraper. Working one piece at a time, roll dough into a log about 6 inches long, dusting with flour as necessary. Split log in half and roll each half into a log about 12 inches long and 3/4-inch wide. You should end up with 8 logs.",
      "Using your bench scraper, cut each log into 8 to 10 gnocchi. Transfer to a parchment-lined baking sheet dusted in semolina flour. Shake to lightly coat gnocchi and prevent sticking. At this point, gnocchi can be frozen. Transfer baking sheet to freezer until gnocchi are completely frozen, about 30 minutes. Transfer gnocchi to a zipper-lock freezer bag and freeze for up to 2 months. Cook directly from frozen, adding a few minutes to cooking time.",
      "To cook, bring a large pot of salted water to a boil. Heat sauce in a separate saucepan until hot but not simmering. Add gnocchi to pot, stir gently, and cook until gnocchi float for 30 seconds, about 3 minutes total. Drain gnocchi, reserving 1/2 cup of pasta cooking water. Add gnocchi and 1/4 cup of cooking water to pot with sauce and bring to a hard boil, stirring gently. Add more pasta water to thin sauce to desired consistency. Season to taste with salt and pepper.",
      "Stir in a big drizzle of olive oil and a handful of chopped fresh herbs. Transfer to a large serving plate. Sprinkle with more herbs and Parmesan cheese. Drizzle with more olive oil. Serve immediately."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "12 ounces best quality ricotta cheese (about 1 1/2 cups, see note)",
          "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus more for serving",
          "4 to 6 ounces all-purpose flour (about 1 cup)",
          "1 whole large egg",
          "1 large egg yolk",
          "Kosher salt and freshly ground black pepper",
          "Semolina flour, for dusting",
          "2 cups your favorite marinara sauce, such as Slow-Cooked Red Sauce",
          "Extra-virgin olive oil",
          "Minced fresh herbs such as basil, parsley, or chives"
        ]
      }
    ]
  },
  {
    "id": 11,
    "created_at": "2022-06-19T21:42:15.235621+00:00",
    "title": "Cheese Stuffed Garlic Pull-Apart Bread",
    "url": "https://cookiesandcups.com/cheese-stuffed-garlic-pull-apart-bread#tasty-recipes-26152",
    "image_url": "https://cookiesandcups.com/wp-content/uploads/2017/01/cheesypullapartbread-7-400x400-1.jpg",
    "instructions": [
      "Combine 2 cups flour, sugar, yeast and salt into the bowl of your stand mixer and mix on low until blended. Combine milk, water and butter in a microwave-safe bowl. Microwave on high in 15 second increments until very warm but not hot to the touch (120° to 130°F. Butter won’t melt completely). Add to flour mixture and then add the egg.",
      "Mix with the paddle attachment for 2 minutes on medium speed, scraping the bowl as needed. Add 1 cup flour; beat 2 minutes at high speed. If necessary, stir in just enough remaining flour so that the dough will form into a ball.",
      "Lightly flour your counter top and knead the dough until smooth and elastic and dough springs back when lightly pressed with 2 fingers, about 6 to 8 minutes. (Alternately you can switch out the paddle attachment for your dough hook on the stand mixer and do this step with the dough hook).",
      "Cover the dough with a towel and let it rest for 10 minutes.",
      "Coat a 10- cup bundt pan with nonstick spray and set aside.",
      "Cut the cheese into 32 pieces or cubes. Set aside.",
      "Cut the dough into 32 pieces. Wrap each piece of dough around a piece of cheese.",
      "For filling, combine butter, Parmesan cheese, garlic powder and Italian herb seasoning in a small bowl.",
      "Dip each dough ball into the melted butter mixture. Place in prepared pan. Pour any remaining butter over rolls and cover with towel. Let the dough rise in warm place until doubled in size, about 45 minutes.",
      "Preheat oven to 375°F. Bake the rolls for 25 to 30 minutes or until golden brown. Cool 5 minutes in pan, then invert on serving plate."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "3 1/4 to 3 3/4 cups all-purpose flour, divided",
          "2 tablespoons sugar",
          "1 packet Fleischmann’s® RapidRise Yeast™ (1/4- ounce or 2 1/4 teaspoons)",
          "1 teaspoon salt",
          "3/4 cup milk",
          "1/4 cup water",
          "1/4 cup butter, room temperature",
          "1 egg",
          "8 ounces mozzarella cheese (not grated)"
        ]
      },
      {
        "title": "Coating",
        "ingredients": [
          "1/2 cup butter, melted",
          "2 tablespoons grated Parmesan cheese",
          "1–1/2 teaspoons Garlic Powder",
          "1–1/2 teaspoons Italian Herb Seasoning"
        ]
      }
    ]
  },
  {
    "id": 13,
    "created_at": "2022-06-19T22:16:35.127199+00:00",
    "title": "Crispy Buffalo Ranch Chicken Salad with Goddess Dressing",
    "url": "https://www.halfbakedharvest.com/crispy-buffalo-ranch-chicken-salad/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2019/07/Crispy-Buffalo-Ranch-Chicken-Salad-with-Goddess-Dressing-1.jpg",
    "instructions": [
      "To make the chicken. Preheat the oven to 425 degrees F. Line a baking sheet with parchment.",
      "Toss the chicken with 2 tablespoons buffalo sauce. Add the Panko, chives, parsley, dill, garlic powder, onion powder, cayenne pepper, and a pinch each of salt and pepper to a medium-sized bowl. Stir to combine. Dredge the chicken through the crumbs, pressing firmly to adhere. Place on the prepared baking sheet. Repeat until all the chicken has been used. Lightly brush/drizzle the chicken with olive oil. Transfer to the oven and bake for 15-20 minutes or until the chicken is cooked through. Drizzle the chicken with the remaining buffalo sauce.",
      "Meanwhile, make the salad. In a large salad bowl, combine the lettuce, carrots, celery, cucumbers, radishes, and cilantro.",
      "To make the goddess dressing. Combine all ingredients in a blender and blend until smooth and creamy, adding water, 1 tablespoon at a time as needed, to thin the sauce. Toss the salad with a few tablespoons of dressing.",
      "To serve, divide the salad among bowls. To each salad add the chicken, avocado, and crumbled cheese. Serve with fresh chives, additional buffalo sauce, and additional goddess dressing. Enjoy!"
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 pound boneless chicken breasts, cutlets, or tenders",
          "1/2 cup buffalo sauce, homemade or store-bought",
          "1 cup Panko bread crumbs",
          "1 tablespoon each dried chives and dried parsley",
          "2 teaspoons dried dill",
          "1 teaspoon each garlic and onion powder",
          "1/2 teaspoon cayenne pepper, more or less to taste",
          "1 pinch each kosher salt and black pepper"
        ]
      },
      {
        "title": "Salad",
        "ingredients": [
          "2 heads romaine lettuce, shredded",
          "4 carrots, shredded",
          "4 celery stalks, chopped",
          "2 Persian cucumbers, chopped",
          "4 radishes thinly, sliced",
          "1/2 cup fresh cilantro or parsley, roughly chopped",
          "1 avocado, sliced",
          "1/2 cup crumbled blue cheese or feta cheese"
        ]
      },
      {
        "title": "Goddess Dressing",
        "ingredients": [
          "1/2 cup plain greek yogurt",
          "1/4 cup extra virgin olive oil",
          "1 cup fresh cilantro",
          "1/2 cup fresh basil",
          "1 jalapeño, halved and seeded",
          "juice from 1 lemon"
        ]
      }
    ]
  },
  {
    "id": 16,
    "created_at": "2022-06-19T22:56:34.396659+00:00",
    "title": "Easy Lasagna Recipe",
    "url": "https://cupcakesandkalechips.com/worlds-best-lasagna-recipe/",
    "image_url": "https://cupcakesandkalechips.com/wp-content/uploads/2018/10/Worlds-Best-Lasagna-Recipe-16.jpg",
    "instructions": [
      "In a large Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until cooked through and browned.",
      "Add the crushed tomatoes, tomato paste, tomato sauce, and water, and stir everything together.",
      "Add sugar, basil, fennel seeds (if using), Italian seasoning, 2 teaspoons salt, pepper, and 2 Tablespoons parsley, and stir to combine.",
      "Simmer, covered, for at least 1½ hours, stirring occasionally. I usually try to simmer for as long as possible.",
      "If using regular lasagna noodles, cook according to package instructions and drain.",
      "In a bowl, stir together ricotta cheese, egg, remaining parsley, and ½ teaspoon salt.",
      "Preheat oven to 375°F.",
      "To layer the lasagna, spread 1½ cups of the sauce in the bottom of a 9×13 inch baking dish. Arrange a single layer of noodles over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese. Sprinkle with ¼ cup Parmesan cheese.",
      "Spoon another 1½ cups meat sauce over the cheese.",
      "Add another layer of noodles, the rest of the ricotta mixture, half of the remaining mozzarella, and another 1/4 cup Parmesan cheese.",
      "Add another layer of 1 1/2 cups of sauce and a final layer of noodles.",
      "Top with another 1 1/2 cups sauce and the remaining mozzarella and Parmesan cheese.",
      "Cover with foil and bake in preheated oven for 25 minutes.",
      "Remove foil, and bake an additional 25 minutes.",
      "Cool for 15 minutes before serving."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 pound sweet Italian turkey sausage",
          "3/4 pound lean ground beef",
          "1/2 cup onion, minced",
          "2 cloves garlic, crushed",
          "28 ounce can crushed tomatoes",
          "two 6 ounce cans tomato paste",
          "two 6.5 ounce cans canned tomato sauce (or one 15 oz. can)",
          "1/2 cup water",
          "2 Tablespoons sugar (optional)",
          "1 1/2 teaspoons dried basil leaves",
          "1/2 teaspoon fennel seeds (optional)",
          "1 teaspoon Italian seasoning",
          "2 teaspoons salt",
          "1/4 teaspoon ground black pepper",
          "4 Tablespoons chopped fresh parsley, divided",
          "12 lasagna noodles, regular or no cook. I usually use no cook noodles.",
          "16 ounces ricotta cheese",
          "1 egg",
          "1/2 teaspoon salt",
          "3/4 pound mozzarella cheese, shredded",
          "3/4 cups grated Parmesan cheese"
        ]
      }
    ]
  },
  {
    "id": 23,
    "created_at": "2022-06-20T23:36:57.680753+00:00",
    "title": "Portillo's Chopped Salad",
    "url": "https://www.chelseasmessyapron.com/portillos-chopped-salad/#wprm-recipe-container-78526",
    "image_url": "https://www.chelseasmessyapron.com/wp-content/uploads/2020/05/Portillos-Chopped-Salad-1.jpg",
    "instructions": [
      "DRESSING: Place all the dressing ingredients in a small blender jar. Blend until combined, creamy, and emulsified. Transfer dressing to a mason jar and store in the fridge until ready to eat. Shake up the dressing before dressing the salad.",
      "COOK PASTA: Cook the pasta according to package directions to al dente. Make sure to generously salt the water; this is what will actually season the pasta! I add 1 teaspoon salt to every 4 cups of water. Drain and cool; run under cold water and shake off to dry. When dry, toss with a few tablespoons of the prepared dressing.",
      "BACON AND CHICKEN: Cook bacon in a skillet or on an electric griddle. Remove, let cool slightly, and then chop coarsely. Chop a rotisserie chicken (or leftover grilled chicken) into small bite-sized pieces.",
      "SALAD ASSEMBLY: In a large bowl, combine the lettuce, red cabbage, halved or quartered tomatoes, and thinly sliced green onions. Add in the cooled pasta, chopped bacon, and chopped chicken. Add gorgonzola cheese. If eating all of this salad, add dressing to desired preference (you may not use it all) and toss to combine. If not, only dress what will be eaten; this salad doesn't sit well with the dressing.",
      "SALAD STORAGE: The salad can be made in advance as long as the salad, bacon, cheese, and dressing is stored separately. Combine right before eating."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "Chopped Salad",
        "ingredients": [
          "1 cup (125g) uncooked ditalini pasta",
          "1/2 cup (43g) cooked and crumbled bacon (7 slices)",
          "2 cups (230g) rotisserie chicken (or leftover grilled chicken), diced",
          "5 cups (250g) chopped lettuce (I like to use half romaine (2-1/2 cups; 100g) and half iceberg lettuce (2-1/2 cups; 150g )",
          "1 and 1/2 cups (130g) chopped red cabbage",
          "1 cup (150g) cherry tomatoes, halved or quartered",
          "1 cup (80g) thinly sliced green onions",
          "1/4- 1/2 (27-57g) cup crumbled gorgonzola cheese"
        ]
      },
      {
        "title": "Creamy Balsamic Dressing",
        "ingredients": [
          "1/2 cup (117g) honey-vanilla Greek yogurt (I recommend Greek Gods)",
          "1/4 cup of EACH balsamic vinegar (54g), pure maple syrup (73g) (not pancake syrup!), olive oil (45g)",
          "1 tablespoon Dijon mustard",
          "1/2 teaspoon EACH finely minced garlic, fine sea salt, freshly cracked pepper"
        ]
      }
    ]
  },
  {
    "id": 12,
    "created_at": "2022-06-19T22:00:41.360543+00:00",
    "title": "Chicken Tikka Masala",
    "url": "https://www.twopeasandtheirpod.com/easy-chicken-tikka-masala/#wprm-recipe-container-39237",
    "image_url": "https://www.twopeasandtheirpod.com/wp-content/uploads/2019/02/Chicken-Tikka-Masala.jpg",
    "instructions": [
      "In a large bowl, stir together the yogurt, lemon juice, garlic, ginger, garam marsala, chili powder, cumin, paprika, salt, and pepper. Add the chicken pieces and stir until the chicken is well coated. Let the chicken marinate in the yogurt sauce for at least 30 minutes. You can refrigerate the chicken overnight.",
      "In a large skillet, heat the oil over medium heat. Add the marinated chicken to the hot skillet and cook, stirring occasionally, until golden, about 4 to 5 minutes. Transfer the chicken to a plate and set aside.",
      "In the same skillet, melt the butter over medium heat. Stir in the onion and cook until tender, about 3 to 5 minutes. Stir in the tomato paste, ginger, garlic, garam masala, turmeric, chili powder, paprika, cumin, and cayenne pepper and cook until well combined, 1 to 2 minutes. Stir in the diced tomatoes and chicken broth. Bring to a boil; reduce the heat and simmer, stirring occasionally, until sauce is slightly thickened, about 10 minutes",
      "Stir in the cream and lemon juice. Add the cooked chicken back into the pan and cook until heated through, about 5 minutes.",
      "Serve warm with rice and naan, if desired."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "For the chicken",
        "ingredients": [
          "1/2 cup whole milk yogurt",
          "1 tablespoon lemon juice",
          "4 cloves garlic minced",
          "2 teaspoons freshly grated ginger",
          "1/2 teaspoon garam marsala",
          "½ teaspoon chili powder",
          "1/2 teaspoon cumin",
          "1/2 teaspoon paprika",
          "1 teaspoon kosher salt",
          "1/4 teaspoon black pepper",
          "1 1/2 pounds boneless skinless chicken thighs cut into 1-inch chunks",
          "2 tablespoons canola oil or grapeseed oil"
        ]
      },
      {
        "title": "For the sauce",
        "ingredients": [
          "2 tablespoons unsalted butter",
          "1 yellow onion diced",
          "2 tablespoons tomato paste",
          "2 teaspoons freshly grated ginger",
          "3 cloves garlic minced",
          "2 1/2 teaspoons garam masala",
          "2 teaspoons ground turmeric",
          "1 teaspoon chili powder",
          "1/2 teaspoon paprika",
          "1/2 teaspoon cumin",
          "¼ teaspoon cayenne pepper",
          "1 (28 oz) can diced or crushed tomatoes",
          "1 cup chicken broth",
          "1/3 cup heavy cream",
          "1 tablespoon fresh lemon juice",
          "1/4 cup chopped fresh cilantro leaves optional",
          "Basmati rice and naan bread for serving, optional"
        ]
      }
    ]
  },
  {
    "id": 3,
    "created_at": "2022-07-04T23:08:54.34209+00:00",
    "title": "Out-Of-This-World Corn Dip",
    "url": "https://inspiredbycharm.com/out-of-this-world-corn-dip/#wprm-recipe-container-19720",
    "image_url": "https://inspiredbycharm.com/wp-content/uploads/2022/07/The-Best-Out-of-this-World-Corn-Dip.jpg",
    "instructions": [
      "In a large bowl, mix all ingredients except chips.",
      "Chill two hours to overnight. Serve with Frito Scoops corn chips."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "3 (11 oz) cans MexiCorn (sweet corn & diced red and green peppers), drained",
          "1 (7 oz) can chopped green chiles",
          "1 (6 oz)can chopped jalapeno peppers - drained and liquid added to taste",
          "1/2 cup green onion - chopped",
          "1 cup mayonnaise",
          "1 cup sour cream",
          "1 teaspoon pepper",
          "1/2 teaspoon garlic powder",
          "1 (16 ounce) package shredded sharp cheddar cheese",
          "2-3 bags Fritos Scoops corn chips"
        ]
      }
    ]
  },
  {
    "id": 4,
    "created_at": "2022-12-01T23:45:58.231361+00:00",
    "title": "Creamy Spinach Turkey Meatballs",
    "url": "https://www.eatwell101.com/creamy-spinach-turkey-meatballs-recipe",
    "image_url": "https://www.eatwell101.com/wp-content/uploads/2021/05/Creamy-Turkey-Meatballs-Recipe-800x533.jpg",
    "instructions": [
      "To make the creamy spinach turkey meatballs: In a large bowl, combine ground turkey and ground chicken, cheese, grated garlic, Italian seasoning, bouillon cube, red chili pepper flakes, chopped cilantro, and black pepper. Mix well with your hands or fork and form medium balls. Arrange the turkey meatballs on a plate and set them aside.",
      "Melt 2 tablespoons butter in a large skillet over medium-low heat. Cook the turkey meatballs for 8 – 10 minutes on all sides until browned and cooked through. Remove to a clean plate and set aside.",
      "In the same pan, melt the butter in the remaining cooking juices. Add in the garlic and fry until fragrant (about one minute). Add onion and stir fry until translucent. Add the sun-dried tomatoes and fry for 1-2 minutes, so they release their flavors. Finally, pour in the vegetable broth, and allow the sauce to reduce slightly. ",
      "Reduce heat to low, add in the heavy cream, and bring to a gentle simmer while stirring occasionally. Season the cream sauce with salt and pepper to taste.",
      "Add in the baby spinach and allow to wilt in the sauce. Finally, add in the parmesan cheese. Allow cream sauce to simmer for a further minute until the cheese melts through. ",
      "Add the cooked turkey meatballs back into the pan; sprinkle with the parsley, and spoon the sauce over each meatball. Serve the creamy garlic spinach Tuscan meatballs over steamed veg or cauliflower rice for Keto dieters, or rice or pasta for non-Keto."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1/2 lb (220g) ground turkey meat",
          "1/2 lb (220g) ground chicken meat",
          "1/2 cup shredded mozzarella (or cheddar, provolone…)",
          "4 cloves garlic, grated + 4 cloves garlic, minced",
          "1 teaspoon Italian seasoning",
          "1/2 teaspoon red crushed chili pepper flakes, optional",
          "1 crumbled bouillon cube, optional",
          "Salt and fresh cracked black pepper, to taste",
          "1 cup fresh chopped cilantro (or parsley), divided",
          "2 teaspoons olive oil",
          "2 tablespoons butter",
          "1 small yellow onion, diced",
          "1/3 cup (80ml) vegetable broth",
          "5 ounces (150g) jarred sun-dried tomato in oil, drained of oil",
          "1 3/4 cups heavy cream",
          "Salt and pepper, to taste",
          "3 cups baby spinach leaves",
          "1/2 cup grated Parmesan",
          "1 tablespoon fresh parsley, chopped"
        ]
      }
    ]
  },
  {
    "id": 6,
    "created_at": "2022-12-18T14:42:09.751455+00:00",
    "title": "Sausage Tortellini Soup",
    "url": "https://lifemadesimplebakes.com/creamy-sausage-and-tortellini-soup",
    "image_url": "https://i2.wp.com/lifemadesimplebakes.com/wp-content/uploads/2017/02/Creamy-Sausage-and-Tortellini-Soup.jpg",
    "instructions": [
      "In a large stockpot set over medium-high, cook the sausage until browned. Using a slotted spoon, transfer the cooked sausage to a paper towel lined plate; set aside.",
      "Add onion, shallot and carrot, sauté for 5 minutes or until the vegetables are soft. Add the garlic and sauté for an additional 2 minutes, or until fragrant, stirring occasionally to prevent it from burning.",
      "Whisk in the flour and cook for 1 minute. Gradually add in the chicken broth, whisk to combine. Continue cooking until the mixture reaches a simmer, then reduce heat to medium-low and simmer for 6 minutes.",
      "Pat as much grease as possible off of the sausage, then add it along with the tortellini, salt, pepper, Italian seasoning, spinach, and half & half. Simmer for 5 minutes, or until the tortellini is fully cooked.",
      "Serve immediately with freshly grated parmesan, if desired."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 lb Italian sausage",
          "1 small yellow onion - diced",
          "1 small shallot - diced",
          "2 large carrots - peeled and diced",
          "4 cloves garlic - minced",
          "1/4 cup all-purpose flour",
          "5 cup chicken broth",
          "14 oz refrigerated cheese tortellini*",
          "1 tsp kosher sea salt",
          "1/2 tsp ground black pepper",
          "1/2 tsp Italian seasoning",
          "6 oz fresh spinach - chopped",
          "2 cup half and half - or heavy cream"
        ]
      }
    ]
  },
  {
    "id": 7,
    "created_at": "2023-01-24T00:51:53.801374+00:00",
    "title": "Broccoli Cheddar Soup",
    "url": "https://www.halfbakedharvest.com/lighter-creamy-broccoli-cheddar-soup/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2022/01/Lighter-Creamy-Broccoli-Cheddar-Soup-1.jpg",
    "instructions": [
      "Melt together the olive oil and butter in a large dutch oven over medium heat. Add the onion, carrots, and thyme, and cook until fragrant, about 10 minutes. Stir in the flour and cook until golden, about 2 minutes, then gradually whisk in the broth. Add the cauliflower and bring to a boil. Cover, and cook over medium heat for 10 minutes, until the cauliflower is tender. ",
      "Transfer the soup to a blender and purée until smooth. Return the soup to the pot. If needed add 1-2 cups water, then the broccoli, bay leaves, paprika, cayenne, and a large pinch each of salt and pepper. Bring to a simmer over medium heat and cook, uncovered, until the broccoli is tender, about 10 minutes.",
      "Remove the bay leaves and blend the soup in batches until the broccoli is finely chopped, but small chunks still remain. ",
      "Return the soup to the stove and set over low heat. Stir in the coconut milk and cheese until melted and creamy. Taste, and add salt and pepper as needed. If the soup is thick, add broth to thin. Ladle into bowls and top with a little extra cheddar and fresh thyme. Enjoy!"
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "2 tablespoons extra virgin olive oil",
          "2 tablespoons butter",
          "1 yellow onion, chopped",
          "2 tablespoons fresh thyme leaves (or 2 teaspoons dried)",
          "2 carrots, chopped",
          "3 tablespoons all-purpose flour, or gluten free flour",
          "6 cups low sodium vegetable or chicken broth",
          "1 small head cauliflower, cut into florets",
          "4 cups broccoli florets",
          "2 bay leaves",
          "1/4 teaspoon smoked (or regular) paprika",
          "1/4 teaspoon cayenne use to taste",
          "kosher salt and black pepper",
          "1/2 cup canned full fat coconut milk",
          "1-2 cups shredded sharp cheddar cheese"
        ]
      }
    ]
  },
  {
    "id": 8,
    "created_at": "2023-01-24T00:53:09.213738+00:00",
    "title": "Crockpot White Chicken Chili Burrito Bowls.",
    "url": "https://www.halfbakedharvest.com/white-chicken-chili-burrito-bowls/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2023/01/Crockpot-White-Chicken-Chili-Burrito-Bowls-1.jpg",
    "instructions": [
      "In the bowl of your crockpot, combine the chicken, peppers, cumin, chili powder and paprika. Season well with salt and pepper. Pour over the salsa verde. Cover and cook on low for 5-6 hours or on high for 3-4 hours.",
      "Lightly shred the chicken. Stir in the beans, cheddar cheese, and cilantro. Cook until the cheese melts, 5 minutes.",
      "Serve the chicken and sauce over bowls of rice. Top, as desired, with lettuce, yogurt/sour cream, cheese, avocado, cilantro, jalapeños, and green onions. Drizzle over the salsa. Zest lime over each bowl. Eat and enjoy with plenty of chips on the side."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 1/2 pounds boneless, skinless chicken breasts or thighs",
          "1 medium yellow onion, chopped",
          "2 poblano peppers, seeded and chopped",
          "2 teaspoons ground cumin",
          "1 teaspoon chili powder",
          "1 teaspoon smoked paprika",
          "kosher salt and black pepper",
          "2 cups salsa verde",
          "1 can white beans, drained",
          "1 cup shredded cheddar cheese",
          "1/2 cup fresh cilantro, chopped",
          "1-2 jalapeños or serrano peppers, sliced",
          "4 cups cooked rice",
          "shredded lettuce, avocado, green onion, and yogurt/sour cream, for serving",
          "1-2 cups favorite salsa",
          "lime zest and juice",
          "tortilla chips, for serving"
        ]
      }
    ]
  },
  {
    "id": 10,
    "created_at": "2023-02-04T01:56:10.291321+00:00",
    "title": "Spicy Pesto and Cheese Stuffed Zucchini Involtini.",
    "url": "https://www.halfbakedharvest.com/spicy-pesto-and-cheese-stuffed-zucchini-involtini/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2019/08/Spicy-Pesto-and-Cheese-Stuffed-Zucchini-Involtini-1.jpg",
    "instructions": [
      "Preheat the oven to 425 degrees F. Lightly grease a 9x13 inch baking dish or dish of similar size.",
      "Heat the olive oil in a large pot over high heat. When the oil shimmers, add the chicken sausage and brown all over, about 5 to 8 minutes. Reduce the heat to low, add the bell pepper, tomatoes, oregano, thyme, crushed red pepper flakes, and a pinch each of salt and pepper. Simmer for 10 minutes or until the sauce thickens slightly. Taste and adjust seasonings as needed.",
      "Meanwhile, using a mandolin or vegetable peeler, peel the zucchini into 1/4 inch wide strips and lay them flat on a paper towel lined counter. You should have around 30 strips. Sprinkle the zucchini with salt.",
      "In a medium bowl, combine the ricotta, fontina, and 1/2 cup pesto.",
      "To assemble, spoon 3/4 of the tomato sauce into the bottom of the prepared baking dish. Grab 2 zucchini ribbons and lay them side by side lengthwise. Spoon about 1 tablespoon of filling onto the center of the zucchini. Roll into a coil and place each seam-side down in the dish as you go. Repeat with remaining zucchini. Spoon the remaining tomato sauce over top of the zucchini and then drizzle the remaining 1/4 cup pesto evenly over everything. Add the mozzarella.",
      "Transfer the baking dish to the oven and bake 15-20 minutes or until the cheese has melted and is lightly browned on top. Cool 5 minutes before serving. Serve with fresh basil and thyme. Enjoy!"
    ],
    "created_by": "9449c1fb-0c6d-49fe-8109-aa7853a7f8a7",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "2 tablespoons extra virgin olive oil",
          "1/2 pound ground spicy Italian chicken sausage",
          "1 red bell pepper, chopped",
          "1 can (14 ounce) crushed San Marzano tomatoes (or 2 cups tomato sauce)",
          "1 tablespoon chopped fresh oregano (or 2 teaspoons dried)",
          "1 tablespoon fresh thyme leaves (or 2 teaspoons dried)",
          "1 pinch crushed red pepper flakes",
          "kosher salt and black pepper",
          "2 large zucchini or yellow summer squash",
          "1 1/2 cups whole milk ricotta cheese",
          "1 cup shredded fontina cheese",
          "3/4 cup basil pesto, homemade or store-bought",
          "4 ounces mozzarella, torn",
          "fresh basil, for serving"
        ]
      }
    ]
  },
  {
    "id": 31,
    "created_at": "2023-07-25T00:39:42.016461+00:00",
    "title": "Potstickers Recipe",
    "url": "https://www.spoonforkbacon.com/pot-stickers/",
    "image_url": "https://www.spoonforkbacon.com/wp-content/uploads/2020/07/potsticker-recipe.jpg",
    "instructions": [
      "Place all filling ingredients into a bowl and mix together until well combined. Set aside.",
      "Brush perimeter of a wonton wrapper with the beaten egg and fill center with 1 heaping tablespoon of pork filling.",
      "Open your dominant hand, palm side up, and hold fingers together.",
      "Place the filled and open wonton wrapper onto your fingers and fold the wrapper in half, only sealing the corner of one side.",
      "Using your other hand, push small pleats onto one side of the wrapper, pressing and sealing with the hand holding the potsticker.",
      "Set aside and repeat until all filling and wrappers have been used.",
      "Heat a large, heavy bottom skillet over medium heat and add 2 tablespoons oil.",
      "Add 5 to 6 pot stickers to skillet, so the crimped side is up, and pan-fry for 3 to 4 minutes.",
      "Add about 3 tablespoons water to the pan and cover for 2 to 4 minute or until the wonton wrappers have softened and steamed and the filling has finished cooking through.",
      "Remove from heat and repeat until all potstickers have been cooked. Serve immediately with dipping sauce.",
      "Choganjang Place all ingredients into a small bowl and whisk together. Serve with potstickers."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "pork filling",
        "ingredients": [
          "12 ounces ground pork",
          "1 baby bok choy, diced (about 1 1/4 cups, diced)",
          "6 water chestnuts, diced",
          "2 green onions, thinly sliced",
          "2 garlic cloves, minced",
          "2 teaspoons minced fresh ginger",
          "1 teaspoon sesame oil",
          "2 teaspoon salt",
          "½ teaspoon cracked black pepper",
          "1 egg, lightly beaten"
        ]
      },
      {
        "title": "assembly",
        "ingredients": [
          "1 egg, lightly beaten",
          "30 round wonton wrappers",
          "4 tablespoons vegetable oil, divided"
        ]
      },
      {
        "title": "yangnyeom ganjang",
        "ingredients": [
          "⅓ cup soy sauce",
          "2 tablespoons rice vinegar",
          "2 teaspoons sesame oil",
          "1 ½ teaspoons gochujaru (Korean chili powder)",
          "2 garlic cloves, minced",
          "1 green onion, thinly sliced",
          "1 teaspoon toasted sesame seeds"
        ]
      }
    ]
  },
  {
    "id": 1,
    "created_at": "2023-07-25T00:28:34+00:00",
    "title": "One Skillet Chicken Tzatziki and Orzo",
    "url": "https://www.halfbakedharvest.com/skillet-chicken-tzatziki-and-orzo/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2023/05/One-Skillet-Chicken-Tzatziki-and-Orzo-1.jpg",
    "instructions": [
      "Preheat the oven to 400° F.",
      "In a bowl, toss together the chicken, 2 tablespoons olive oil, tomato paste, paprika, garlic, lemon zest, chili flakes, salt, and pepper.",
      "Add the chicken to a large oven-safe skillet set over high heat. Sear on both sides until golden, 3-5 minutes. During the last 2 minutes of cooking, add the butter, then remove the chicken from the skillet. Add the orzo and thyme. Cook until toasted, about 1 minute. Add the sun-dried tomatoes, broth, and lemon juice. Season with salt and pepper. Stir in the fresh herbs. Slide the chicken and any juices left on the plate back into the skillet. ",
      "Bake, uncovered for 15 minutes or until the chicken is cooked through.",
      "Serve the chicken and orzo topped with Tzakiki sauce and basil. Enjoy!"
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "3 tablespoons extra virgin olive oil",
          "2 tablespoons tomato paste",
          "1 tablespoon smoked paprika",
          "6 cloves garlic, chopped",
          "1 tablespoon lemon zest and 2 tablespoons lemon juice",
          "1 pinch chili flakes",
          "kosher salt and black pepper",
          "2 pounds boneless chicken thighs or breast",
          "2 tablespoons salted butter",
          "2 tablespoons fresh thyme",
          "1 1/2 cups dry orzo pasta",
          "1/2 cup oil packed sun-dried tomatoes, chopped",
          "3 cups low sodium chicken broth",
          "1/2 cup mixed herbs, such as basil and thyme",
          "1-2 cups Tzakiki sauce"
        ]
      }
    ]
  },
  {
    "id": 32,
    "created_at": "2023-08-14T17:14:40.65657+00:00",
    "title": "Korean Beef and Avocado Rice Rolls",
    "url": "https://www.halfbakedharvest.com/beef-and-avocado-rice-rolls/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2023/06/30-Minute-Korean-Beef-and-Avocado-Rice-Rolls-1.jpg",
    "instructions": [
      "In a large skillet, cook the beef with black pepper over medium heat, breaking up the meat as it cooks until browned, about 5 minutes. Add the garlic, and ginger, cook another minute. Add the tamari, Gochujang (Korean chili paste), and maple or honey. Bring the mixture to a simmer and cook until the sauce coats the beef, 3-5 minutes. Remove from the heat.",
      "Place one tortilla at a time in the microwave for 15 seconds. Then spoon the beef down the center and top with rice, cilantro, green onion, avocado, mango and/or bell pepper, and then (if using) sesame seeds. Fold the tortilla over the filling. Then fold the sides and ends of the tortillas over the filling and roll forward. Repeat with remaining ingredients.",
      "To make the sriracha sauce, whisk all ingredients in a bowl. ",
      "Serve warm with sriracha mayo, chili oil, and limes."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 1/2 pounds ground beef (or chicken or pork)",
          "black pepper",
          "4 cloves garlic, chopped",
          "1 tablespoon fresh grated ginger (or 1/4 cup candied ginger)",
          "1/2 cup tamari or soy sauce",
          "2-3 tablespoons Gochujang (Korean chili paste)",
          "2-3 tablespoons maple or honey",
          "2 cups cooked rice",
          "1/4 cup chopped green onions",
          "2 cups cilantro, chopped",
          "1/2 cup diced mango (optional)",
          "1 bell pepper, sliced (optional)",
          "1 cup diced avocado",
          "2 tablespoons sesame seeds",
          "8-10 flour tortillas, warmed",
          "chili oil, for serving"
        ]
      },
      {
        "title": "Sriracha Sauce",
        "ingredients": [
          "1/3 cup cream cheese, gently melted",
          "3 tablespoons mayo",
          "1-2 tablespoons sriracha",
          "2 teaspoons tamari or soy sauce"
        ]
      }
    ]
  },
  {
    "id": 37,
    "created_at": "2023-12-31T01:18:29.581456+00:00",
    "title": "Wisconsin Old Fashioned",
    "url": "https://sweetphi.com/wisconsin-brandy-old-fashioned-sour/",
    "image_url": "https://sweetphi.com/wp-content/uploads/2014/05/Wisconsin-Old-Fashioned-Recipe.png",
    "instructions": [
      "In a cocktail glass muddle sugar, orange slice, cherries and bitters, add shot of brandy and stir.",
      "Add ice to fill the glass, then top it off with 50/50 or Squirt Soda and enjoy!"
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1.5 oz. Brandy or about one shot",
          "1 tsp. Sugar",
          "1 Orange Slice",
          "2 Cherries and their juices",
          "Dash of bitters 1 dropper full - 10 drops",
          "Top the glass off with 50/50 or Squirt Soda",
          "Ice Cubes"
        ]
      }
    ]
  },
  {
    "id": 38,
    "created_at": "2024-03-10T17:45:17.442778+00:00",
    "title": "Spicy Chicken Yum Yum Rice Bowls",
    "url": "https://www.halfbakedharvest.com/chicken-yum-yum-rice-bowls/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2023/01/Spicy-Chicken-Yum-Yum-Rice-Bowls-1.jpg",
    "instructions": [
      "Preheat the oven to 425° F. ",
      "On a large sheet pan, toss the chicken with 1 tablespoon tamari and 1 tablespoon orange juice. Season with pepper. Sprinkle the cornstarch (or arrowroot powder) over the chicken, lightly toss. drizzle with olive oil. Bake 15 minutes.",
      "To make the sauce. In a bowl, whisk 1/3 cup tamari, 2 tablespoons orange juice, honey, chili paste, garlic, and ginger.",
      "When the chicken is ready, pour two-thirds of the sauce over the chicken. Toss and bake another 5 minutes, or until cooked through. Switch the oven to broil. Broil 1-2 minutes, until the chicken chars on the edges. If desired, spoon over the remaining sauce. ",
      "Meanwhile, make the yum yum sauce. Combine all ingredients in a bowl. Taste and season with cayenne and salt.",
      "To assemble, add the rice to bowls, top with cucumber, avocado, chicken, kimchi, green onions, and a big handful of fried wontons. Spoon over the yum yum."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 1/2 pounds boneless skinless chicken breasts or thighs, thinly sliced",
          "1 tablespoon cornstarch or arrowroot powder",
          "1 tablespoon, plus 1/3 cup tamari or soy sauce",
          "2 tablespoons extra virgin olive oil",
          "black pepper",
          "2 tablespoons orange juice",
          "1/4 cup honey",
          "2-3 tablespoons chili paste",
          "1 tablespoon chopped fresh ginger",
          "2 cloves garlic, chopped",
          "3-4 cups cooked rice",
          "cucumber, avocado, kimchi, and fried wontons – for serving"
        ]
      },
      {
        "title": "Yum Yum Sauce",
        "ingredients": [
          "1/3 cup olive oil mayo",
          "2 tablespoons ketchup",
          "1 tablespoon Worcestershire sauce",
          "1 teaspoon seasoned salt",
          "1/4 teaspoon cayenne"
        ]
      }
    ]
  },
  {
    "id": 39,
    "created_at": "2024-11-25T00:43:58.416742+00:00",
    "title": "Crockpot Thai Yellow Curry Chicken",
    "url": "https://www.halfbakedharvest.com/yellow-curry-chicken/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2024/03/Crockpot-Thai-Yellow-Curry-Chicken-1.jpg",
    "instructions": [
      "In the bowl of your crockpot, combine the chicken, yogurt, curry paste, curry powder, ginger, lemongrass paste, and season with salt. Toss to coat the chicken. Let sit 10 minutes. Add the onion, potatoes, coconut milk, and fish sauce. Cover and cook on low for 5-6 hours or on high for 3-4 hours.",
      "Crank the heat to high. Cook uncovered for 15 minutes until thickened. Stir in the cilantro, lime zest, and juice.",
      "Melt the butter and garlic together. Cook until the butter is lightly browning. Remove from the heat. Mix in the green onions. ",
      "Serve the chicken and sauce over bowls of rice with garlic butter spooned over the rice. "
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "2 pounds boneless chicken breasts, cubed",
          "1/3 cup plain Greek yogurt",
          "2 tablespoons Thai red curry paste",
          "2-3 tablespoons yellow curry powder",
          "2 tablespoons chopped pickled ginger",
          "1 tablespoon lemongrass paste",
          "1 yellow onion, chopped",
          "2 cups chopped potatoes",
          "1 can full-fat coconut milk",
          "1 tablespoon fish sauce or tamari",
          "1/3 cup chopped fresh cilantro",
          "juice and zest of 1 lime",
          "4 tablespoons salted butter",
          "3-4 cloves garlic, chopped",
          "1/4 cup chopped green onion",
          "steamed rice, for serving"
        ]
      }
    ]
  },
  {
    "id": 9,
    "created_at": "2023-02-01T19:43:28.51325+00:00",
    "title": "Indian Butter Chicken",
    "url": "https://www.halfbakedharvest.com/butter-chicken/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2020/12/30-Minute-Spicy-Indian-Butter-Chicken-1.jpg",
    "instructions": [
      "In a bowl, toss together the chicken, yogurt, 3 cloves garlic, 1 tablespoon ginger, 2 teaspoons garam masala, 1 teaspoon cumin, 1/2 teaspoon turmeric, 1/2 - 1 teaspoon cayenne pepper, and 1 teaspoon salt. Let sit 5-10 minutes. ",
      "Heat the oil in a large skillet over medium-high heat. Add the chicken and sear on both sides until browned, about 2 minutes. Add 1 tablespoon butter and toss to coat the chicken. Remove the chicken from the skillet to a plate. ",
      "To the skillet, add the onion and cook 5 minutes, until softened. Add 2 tablespoons butter, 3 cloves garlic, 1 tablespoon ginger, 1 tablespoon garam masala, 1 teaspoon cumin, 1/2 teaspoon turmeric, 1/2 - 1 teaspoon cayenne pepper, and the chili flakes. Season with salt and pepper. Cook until very fragrant, about 5 minutes. Add the tomato paste and continue cooking another 3-4 minutes. ",
      "Reduce the heat to low. Add 1 cup water and the coconut milk. Stir to combine, bring the sauce to a simmer, cook 5 minutes or until the sauce thickens slightly. Stir in 1 tablespoon butter. If the sauce seems thick, thin with 1/2 to 1 cup additional coconut milk. Add the chicken and any juices on the pan and cook, stirring occasionally, until the sauce thickens slightly, about 5 minutes. Remove from the heat and stir in the cilantro. Season with salt and pepper.",
      "Serve the chicken and sauce over bowls of rice with fresh naan. Enjoy!"
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "2 pounds boneless skinless chicken breasts or thighs, cut into bite-size chunks",
          "1/4 cup plain Greek yogurt",
          "6 cloves garlic, minced or grated",
          "2 tablespoons fresh grated ginger",
          "2 teaspoons plus 1 tablespoon garam masala",
          "2 teaspoons cumin",
          "1 teaspoon turmeric",
          "1-2 teaspoons cayenne pepper, use to your taste",
          "kosher salt and black pepper",
          "2 tablespoons extra virgin olive oil",
          "4 tablespoons salted butter",
          "1 large yellow onion, chopped",
          "1-2 teaspoons crushed red pepper flakes, use to your taste",
          "1/2 cup tomato paste",
          "1 (14 ounce) can full-fat coconut milk (or sub 1 cup cream)",
          "1/2 cup fresh cilantro roughly, chopped",
          "steamed rice and naan, for serving"
        ]
      }
    ]
  },
  {
    "id": 30,
    "created_at": "2023-07-25T00:38:18.021481+00:00",
    "title": "Chopped Buffalo Chicken Skewer Salad",
    "url": "https://www.halfbakedharvest.com/buffalo-chicken-skewer-salad/",
    "image_url": "https://www.halfbakedharvest.com/wp-content/uploads/2023/06/Chopped-Buffalo-Chicken-Skewer-Salad-1.jpg",
    "instructions": [
      "In a bowl, mix the buffalo sauce and honey.",
      "Toss together the olive oil, chicken, seasoned salt, and a pinch of pepper. Add 1/4 cup honey buffalo sauce, toss to coat. Thread the chicken onto the skewers.",
      "Set your grill, grill pan, or skillet to medium-high heat. Grill the skewers until lightly charred and cooked through, turning them occasionally throughout cooking, about 10 to 12 minutes total. ",
      " Meanwhile, make the dressing. Combine all ingredients in a blender and blend until creamy. Taste and adjust the salt and pepper",
      "Toss the greens, cilantro, tomatoes, corn, and peperoncini with 1/2 the dressing. Arrange the chicken, cheese, bacon, and avocado on top. Serve with additional dressing and honey buffalo sauce. Enjoy!"
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "Salad",
        "ingredients": [
          "2/3 cup buffalo sauce (or use hot sauce)",
          "1/4 cup honey",
          "2 tablespoons extra virgin olive oil",
          "2 pounds chicken breasts, cut into cubes",
          "1 tablespoon seasoned salt",
          "6 cups shredded lettuce",
          "1/3 cup fresh cilantro, chopped",
          "1 cup cherry tomatoes, sliced",
          "1 cup grilled corn kernels (about 2 ears)",
          "1/4 cup chopped, peperoncini",
          "1 cup crumbled blue cheese or cubed cheddar",
          "6 strips cooked bacon, crumbled",
          "1 avocado, chopped"
        ]
      },
      {
        "title": "Dressing",
        "ingredients": [
          "1/2 cup sour cream or plain Greek yogurt",
          "1/3 cup mayo",
          "1/2 cup pickled jalapeños",
          "1/3 cup fresh cilantro",
          "3 tablespoons fresh basil",
          "2 tablespoons chopped fresh dill",
          "1 teaspoon garlic powder",
          "kosher salt and black pepper"
        ]
      }
    ]
  },
  {
    "id": 28,
    "created_at": "2022-06-20T23:54:36.44844+00:00",
    "title": "Korean Beef Bowl",
    "url": "https://realsimplegood.com/korean-beef-bowl/",
    "image_url": "https://realsimplegood.com/wp-content/uploads/Healthy-20-minute-korean-beef-bowl-5.jpg",
    "instructions": [
      "Start by preparing rice to have it ready. If serving with cauliflower rice, wait until the beef is almost done as it only takes a few minutes to cook.",
      "Dice shallot and grate ginger to have it ready.",
      "Heat a large skillet over medium-high heat and add sesame oil. Once hot, add in ground beef. Break the beef up into small bits.",
      "Add the shallot, ginger, red pepper, garlic powder, and onion powder and mix with the beef. Continue cooking, stirring occasionally, until the meat is browned and developing some crispy bits, about 8 minutes.",
      "Add the coconut aminos and fish sauce and cook for another 3-4 minutes.",
      "If you are making the optional sauce, mix the mayo and hot sauce in a small bowl.",
      "Serve beef in a bowl over a bed of greens with rice or cauliflower rice. Top with optional sauce and enjoy."
    ],
    "created_by": "e213ee52-adf0-406c-bc9f-f606a419076c",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "1 shallot, diced",
          "2 inches fresh ginger, peeled and grated on a microplane",
          "1 tablespoon toasted sesame oil",
          "2 pounds ground beef, (see notes)",
          "1 teaspoon red pepper flakes",
          "1 teaspoon garlic powder",
          "1 teaspoon onion powder",
          "1/2 cup coconut aminos, (see notes)",
          "2 tbsp fish sauce, (see notes)",
          "4 cups cauliflower rice, (can sub white rice if you’re not doing Whole30)",
          "6 cups greens of choice, (chopped romaine, arugula, spinach, etc.)"
        ]
      },
      {
        "title": "Optional sauce",
        "ingredients": [
          "1/4 cup mayo",
          "1 tbsp hot sauce, (adjust to taste)"
        ]
      },
      {
        "title": "Optional toppings",
        "ingredients": [
          "chopped green onions",
          "sliced avocado"
        ]
      }
    ]
  },
  {
    "id": 5,
    "created_at": "2022-12-02T17:22:11.213926+00:00",
    "title": "Baked Potato Soup",
    "url": "https://thecozycook.com/baked-potato-soup/",
    "image_url": "https://thecozycook.com/wp-content/uploads/2020/09/Baked-Potato-Soup.jpg",
    "instructions": [
      "Shred the cheese from a block, measure out the sour cream and half and half. Let them all sit out at room temperature.",
      "Cut the bacon into 1-inch squares with kitchen shears. Cook in a large pot over low heat, rotating occasionally. They’ll overlap at first but will shrink down as they cook. Remove and set aside once crisp. Leave 2 Tablespoons of drippings in the pot.",
      "While the bacon cooks, peel the potatoes and cut them into 1-inch cubes. Add to a stock pot and cover the potatoes with 1 inch of water. Add the salt and boil gently for 20 minutes or until very fork tender. Drain, then gently mash. Set aside.",
      "Add the diced onion to the pot with the bacon drippings and cook until softened, about 5 minutes.",
      "Add garlic and butter and cook 1 more minute.",
      "Whisk in flour, use a silicone spatula to stir as the flour cooks for 1 full minute to remove the raw flour taste.",
      "Add the chicken broth. Use a silicone spatula to loosen any bacon remnants from the bottom of the pot, this will add flavor.",
      "Slowly add the half and half. Bring to a boil, then reduce to a simmer.",
      "Stir in the potatoes, then mix in the sour cream, and pepper.",
      "Remove from heat. If desired, blend with an immersion blender or transfer it to a blender in batches. (I prefer to do this for a creamier and smoother consistency.)",
      "Gradually sprinkle with shredded cheese and stir until combined. Make sure the base of the soup isn’t too hot or the cheese won’t melt creamy and smooth. The soup will continue to thicken as it sits.",
      "Garnish with green onions and bacon, serve!"
    ],
    "created_by": "9449c1fb-0c6d-49fe-8109-aa7853a7f8a7",
    "ingredients": [
      {
        "title": "",
        "ingredients": [
          "4 large russet potatoes, equal to 2 lbs.",
          "¾ teaspoon salt",
          "6 slices thick cut bacon",
          "1 large yellow onion",
          "3 cloves garlic, minced",
          "2 Tablespoon butter",
          "¼ cup flour",
          "3 ½ cups Chicken broth",
          "2 cups half and half",
          "¾ cup sour cream",
          "½ teaspoon pepper",
          "2 cups shredded cheddar cheese",
          "1/8 cup chives, finely diced"
        ]
      }
    ]
  }
]